Revit 2024 API
FaceArray.Item Property
Gets or sets a face at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual Face this[
	int index
] { get; set; }
Visual Basic
Public Overridable Property Item ( _
	index As Integer _
) As Face
	Get
	Set
Visual C++
public:
virtual property Face^ Item[int index] {
	Face^ get (int index);
	void set (int index, Face^ value);
}
Parameters
index
Type: System.Int32
The index of the face to be set or retrieved.
Return Value
Returns the face at the specified index.
See Also
FaceArray Class
Autodesk.Revit.DB Namespace